**Terraform Format and Style🖌** `success`
**Terraform Initialization ⚙️** `success`
**Terraform Plan 📖** `success`
**Terraform Validation 🤖** `success`

<details><summary>Show Plan</summary>

```
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=29377241]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26161960]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.spf: Refreshing state... [id=29377243]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=29377237]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=29377247]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=29377239]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mail: Refreshing state... [id=29377236]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=29377238]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=29377242]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=29377246]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161939]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=29377248]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161931]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161972]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161944]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161949]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.bimi: Refreshing state... [id=32326124]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161958]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161942]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.www_cname: Refreshing state... [id=28036169]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161934]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161943]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mail: Refreshing state... [id=26161935]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161946]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161936]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161937]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326125]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161945]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26161940]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26161967]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26880816]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26880822]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26880820]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26880824]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26880814]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26880815]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.bimi: Refreshing state... [id=32326126]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26880813]
module.dnsimple_github_pages.dnsimple_zone_record.alias-record-root: Refreshing state... [id=26161929]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161953]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26880818]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.spf: Refreshing state... [id=26880826]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[0]: Refreshing state... [id=28036165]
module.dnsimple_github_pages.dnsimple_zone_record.cname-record-www: Refreshing state... [id=26161971]
module.dnsimple_short_io.dnsimple_zone_record.a_record_2: Refreshing state... [id=26982611]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mail: Refreshing state... [id=26161951]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.spf: Refreshing state... [id=26161968]
module.dnsimple_short_io.dnsimple_zone_record.a_record_1: Refreshing state... [id=26982612]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161947]
dnsimple_zone_record.files_wtmn_net_alias: Refreshing state... [id=27004600]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=29377250]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.verify_cname: Refreshing state... [id=28036170]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=29377249]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26880821]
dnsimple_zone_record.github_redirect: Refreshing state... [id=26395267]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161962]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326123]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.spf: Refreshing state... [id=26161961]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26161966]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mail: Refreshing state... [id=26880812]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26880817]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=29377244]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=29377245]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161932]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26880825]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26880823]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161933]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161954]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161955]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[1]: Refreshing state... [id=28036168]
data.github_user.georgewitteman: Reading...
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[3]: Refreshing state... [id=28036167]
data.tls_certificate.github: Reading...
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[2]: Refreshing state... [id=28036166]
data.tls_certificate.github: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
aws_kms_key.dynamo_db_kms: Refreshing state... [id=1a1ca031-daf5-4f17-aa7d-2d2d2ca5a865]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com]
data.github_user.georgewitteman: Read complete after 0s [id=5918935]
aws_kms_key.primary_kms_key: Refreshing state... [id=d5eef806-22ba-4f53-a96f-3d3e6e545e07]
aws_s3_bucket.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
aws_iam_role.github_oidc: Refreshing state... [id=GitHubActionsOIDC]
aws_s3_bucket_acl.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs,log-delivery-write]
aws_s3_bucket_public_access_block.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_server_side_encryption_configuration.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_versioning.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_logging.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.github_oidc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "github_oidc" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAllValues:StringEquals"
              + values   = [
                  + "https://token.actions.githubusercontent.com",
                ]
              + variable = "token.actions.githubusercontent.com:iss"
            }
          + condition {
              + test     = "ForAllValues:StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:georgewitteman/terraform*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_dynamodb_table.terraform_locks will be updated in-place
  ~ resource "aws_dynamodb_table" "terraform_locks" {
        id             = "terraform-locks"
        name           = "terraform-locks"
        tags           = {}
      ~ tags_all       = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_iam_openid_connect_provider.github will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "github" {
        id              = "arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com"
        tags            = {}
      ~ tags_all        = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.github_oidc will be updated in-place
  ~ resource "aws_iam_role" "github_oidc" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAllValues:StringEquals" = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              - "token.actions.githubusercontent.com:iss" = "https://token.actions.githubusercontent.com"
                            }
                          - StringLike                  = {
                              - "token.actions.githubusercontent.com:sub" = "repo:georgewitteman/terraform*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "GitHubActionsOIDC"
        name                  = "GitHubActionsOIDC"
        tags                  = {}
      ~ tags_all              = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_kms_key.dynamo_db_kms will be updated in-place
  ~ resource "aws_kms_key" "dynamo_db_kms" {
        id                                 = "1a1ca031-daf5-4f17-aa7d-2d2d2ca5a865"
        tags                               = {}
      ~ tags_all                           = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_kms_key.primary_kms_key will be updated in-place
  ~ resource "aws_kms_key" "primary_kms_key" {
        id                                 = "d5eef806-22ba-4f53-a96f-3d3e6e545e07"
        tags                               = {}
      ~ tags_all                           = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_s3_bucket.log_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "log_bucket" {
        id                          = "georgewitteman-terraform-logs"
        tags                        = {}
      ~ tags_all                    = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.terraform_state will be updated in-place
  ~ resource "aws_s3_bucket" "terraform_state" {
        id                          = "georgewitteman-terraform-state"
        tags                        = {}
      ~ tags_all                    = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
    }

Plan: 1 to add, 7 to change, 0 to destroy.

Changes to Outputs:
  + github_user_key = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFBNCIplFb70z+C9pxD9oOchI3JbDAhuNzUDpL9+9ehK"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @georgewitteman, Action: `pull_request`*